import { NAVBAR, HOME, PORTFOLIO, SKILLS, CONTACT } from "./namespaces";

export const elTranslations = {
    [NAVBAR]: {
        home: "Home",
        portfolio: "Portfolio",
        skills: "Skills",
        contact: "Contact",
        more: "More",
        options: "Επιλογές",
        back: "Πίσω",
        languages: "Γλώσσα",
        theme: "Θέμα",
        english: "Αγγλικά",
        greek: "Ελληνικά",
      },
    [HOME]: {
        hello: "Γεια σας",
        iAmGeorge: "ονομάζομαι Γιώργος",
        lastName: "Παπαστεργιόπουλος",
        me: "Εγώ",
        meTextOne: "Γεια σας, είμαι ο Γιώργος και εδώ είναι λίγα πράγματα για μένα. Είμαι 27 ετών και Front-End Developer με βάση την Ξάνθη, μια μικρή πόλη στην Ελλάδα, με μεγάλη αγάπη για την ανάπτυξη ιστοσελίδων και το πάθος να δημιουργώ διαδραστικές, ευέλικτες εμπειρίες στο διαδίκτυο. Πάντα με ενθουσιάζει η εξερεύνηση νέων τεχνολογιών και δημιουργικών λύσεων.",
        meTextTwo: "Ως αυτοδίδακτος προγραμματιστής, προσπαθώ συνεχώς να παραμένω ενημερωμένος για τις τελευταίες τάσεις και βέλτιστες πρακτικές στην ανάπτυξη front-end. Πιστεύω ότι η συνεχής μάθηση είναι το κλειδί για την ανάπτυξη, γι' αυτό φροντίζω να διευρύνω τις γνώσεις μου και να βελτιώνω τις δεξιότητές μου τακτικά. Στόχος μου είναι να παραδίδω έργα υψηλής ποιότητας που ισορροπούν δημιουργικότητα και λειτουργικότητα, διασφαλίζοντας ότι οι χρήστες έχουν μια απρόσκοπτη και ελκυστική εμπειρία.",
        meTextThree: "Έχω ιδιαίτερο ενδιαφέρον για τη React και απολαμβάνω να αξιοποιώ τις δυνατότητές του για τη δημιουργία δυναμικών, φιλικών προς το χρήστη διεπαφών. Η εστίασή μου περιλαμβάνει επίσης τον ευέλικτο σχεδιασμό και τη βελτιστοποίηση της απόδοσης, καθώς πιστεύω ότι αυτά τα στοιχεία είναι κρίσιμα για μια εξαιρετική εμπειρία χρήστη. Ανυπομονώ να εμπλακώ σε φιλόδοξα έργα όπου μπορώ να συνεισφέρω, να εξελιχθώ και να αφήσω ένα σημαντικό αποτύπωμα.",
        meTextFour: "Αυτή τη στιγμή αναζητώ την πρώτη μου επαγγελματική ευκαιρία για συνεργασία με μια δυναμική ομάδα και να εργαστώ σε προκλητικά έργα που ωθούν τα όρια του τι μπορεί να επιτύχει η ανάπτυξη ιστοσελίδων. Είμαι βέβαιος ότι το πάθος μου, η αφοσίωση και η επιθυμία μου για μάθηση θα με κάνουν πολύτιμη προσθήκη σε κάθε έργο.",
    },
    [PORTFOLIO]: {
        kardias: "Καρδιάς",
        kardiasText: "Το Καρδιάς είναι ένα απλοποιημένο σύστημα για την αποτελεσματική διαχείριση ενοικίασης κατοικιών. *(Χρειάζεται λίγα δευτερόλεπτα στην πρώτη εμφάνιση)",
        stratakisLab: "Stratakis Lab",
        stratakisLabText: "Το Stratakis Lab είναι μια σελίδα για το Εργαστήριο Υπερταχέως Λέιζερ Μικρο- και Νανο-επεξεργασίας του Πανεπιστημίου Κρήτης, που αναδεικνύει την έρευνα και τις καινοτομίες τους. *(Χρειάζεται λίγα δευτερόλεπτα στην πρώτη εμφάνιση)",
        weather: "Whether",
        weatherText: "Το Weather είναι ένα προσωπικό έργο που δημιούργησα για να εξασκηθώ στην ενσωμάτωση API και τη διαχείριση κατάστασης χρησιμοποιώντας το Redux Toolkit.",
        gameHub: "Game Hub",
        gameHubText: "Αυτό το έργο δημιουργήθηκε παράλληλα με ένα tutorial για να εξασκηθώ στη React με την TypeScript.",
      },
    [SKILLS]: {
        textOne: "Από τότε που ξεκίνησα το ταξίδι μου ως φοιτητής Front-end πριν από σχεδόν 3 χρόνια, έχω μάθει πολλά και έχω δημιουργήσει ορισμένα καλά προσωπικά έργα. Τώρα αναζητώ μια ευκαιρία να χρησιμοποιήσω όσα έχω μάθει και να μάθω περισσότερα με μια καλή ομάδα.",
        textTwo: "Όλα τα έργα μου είναι διαθέσιμα στο προφίλ μου στο Github, και αν πιστεύετε ότι μπορώ να αποτελέσω μέρος της ομάδας σας και να συνεργαστούμε, μπορείτε να επικοινωνήσετε μαζί μου μέσω του προφίλ μου στο LinkedIn.",
    },
    [CONTACT]: {
        or: "ή",
        name: "Όνομα",
        email: "Email",
        subject: "Θέμα",
        message: "Μήνυμα",
      },
};
