import { NAVBAR, HOME, PORTFOLIO, SKILLS, CONTACT } from "./namespaces";

export const elTranslations = {
    [NAVBAR]: {
        home: "Home",
        portfolio: "Portfolio",
        skills: "Skills",
        contact: "Contact",
        more: "More",
        options: "Επιλογές",
        back: "Πίσω",
        languages: "Γλώσσα",
        theme: "Θέμα",
        english: "Αγγλικά",
        greek: "Ελληνικά",
      },
    [HOME]: {
        hello: "Γεια σας",
        iAmGeorge: "ονομάζομαι Γιώργος",
        lastName: "Παπαστεργιόπουλος",
        me: "Σχετικά με εμένα ",
        meTextOne: "Γεια σας, είμαι ο Γιώργος και θα ήθελα να σας πω λίγα λόγια για μένα. Είμαι 27 ετών και Front-End Developer που ζει στην Ελλάδα, με έντονο πάθος για την ανάπτυξη ιστοσελίδων και αγάπη για τη δημιουργία διαδραστικών και responsive διαδικτυακών εμπειριών. Είμαι πάντα ενθουσιασμένος να εξερευνώ νέες τεχνολογίες και δημιουργικές λύσεις.",
        meTextTwo: "Συνεχώς προσπαθώ να παραμένω ενημερωμένος για τις τελευταίες τάσεις και τις βέλτιστες πρακτικές στην ανάπτυξη front-end. Πιστεύω ότι η συνεχής μάθηση είναι το κλειδί για την ανάπτυξη, γι' αυτό και κάνω το παν για να επεκτείνω τις γνώσεις μου και να εξελίξω τις δεξιότητές μου τακτικά. Σκοπός μου είναι να παραδίδω ποιοτική δουλειά που ισορροπεί ανάμεσα στη δημιουργικότητα και τη λειτουργικότητα, διασφαλίζοντας ότι οι χρήστες απολαμβάνουν μια απρόσκοπτη και ελκυστική εμπειρία.",
        meTextThree: "Έχω ιδιαίτερο ενδιαφέρον για το React και μου αρέσει να αξιοποιώ τις δυνατότητές της για να δημιουργώ δυναμικές και φιλικές προς τον χρήστη διεπαφές. Είμαι πρόθυμος να συμμετάσχω σε φιλόδοξα έργα, όπου μπορώ να συμβάλω, να εξελιχθώ και να κάνω μια σημαντική διαφορά.",
        meTextFour: "Αυτή τη στιγμή αναζητώ την πρώτη μου επαγγελματική ευκαιρία για να συνεργαστώ με μια δημιουργική ομάδα και να συμμετάσχω σε προκλητικά έργα που θα δοκιμάσουν τα όρια των ικανοτήτων μου. Είμαι σίγουρος ότι το πάθος, η αφοσίωση και η διάθεσή μου για μάθηση θα με καθιστούν πολύτιμη προσθήκη σε οποιοδήποτε έργο.",
    },
    [PORTFOLIO]: {
        kardias: "Καρδιάς",
        kardiasText: "Το Καρδιάς είναι ένα απλοποιημένο σύστημα για την αποτελεσματική διαχείριση ενοικίασης κατοικιών. *(Χρειάζεται λίγα δευτερόλεπτα στην πρώτη εμφάνιση)",
        stratakisLab: "Stratakis Lab",
        stratakisLabText: "Το Stratakis Lab είναι μια σελίδα για το Εργαστήριο Υπερταχέως Λέιζερ Μικρο- και Νανο-επεξεργασίας του Πανεπιστημίου Κρήτης, που αναδεικνύει την έρευνα και τις καινοτομίες τους. *(Χρειάζεται λίγα δευτερόλεπτα στην πρώτη εμφάνιση)",
        weather: "Whether",
        weatherText: "Το Weather είναι ένα προσωπικό έργο που δημιούργησα για να εξασκηθώ στην ενσωμάτωση API και τη διαχείριση κατάστασης χρησιμοποιώντας το Redux Toolkit.",
        gameHub: "Game Hub",
        gameHubText: "Αυτό το έργο δημιουργήθηκε παράλληλα με ένα tutorial για να εξασκηθώ στη React με την TypeScript.",
      },
    [SKILLS]: {
        textOne: "Από τότε που ξεκίνησα το ταξίδι μου ως Front-end developer πριν από σχεδόν 3 χρόνια, έχω μάθει πολλά και έχω δημιουργήσει ορισμένα καλά προσωπικά έργα. Τώρα αναζητώ μια ευκαιρία να χρησιμοποιήσω όσα έχω μάθει και να μάθω περισσότερα με μια καλή ομάδα.",
        textTwo: "Όλα τα έργα μου είναι διαθέσιμα στο προφίλ μου στο Github, και αν πιστεύετε ότι μπορώ να αποτελέσω μέρος της ομάδας σας και να συνεργαστούμε, μπορείτε να επικοινωνήσετε μαζί μου μέσω του προφίλ μου στο LinkedIn.",
    },
    [CONTACT]: {
        or: "ή",
        name: "Όνομα",
        email: "Email",
        subject: "Θέμα",
        message: "Μήνυμα",
      },
};
